Repository: Webierta/phototook
Catalog: lib/l10n/app_*.arb
Languages: de, es

# searchHomeSearch
source: Search
de: Suchen
es: Buscar

# searchHomeError
source: There was an error getting the photos
de: Es gab einen Fehler, den die Fotos zu erhalten
es: Se ha producido un error obteniendo las fotos

# searchHomeFilters
source: Filters
de: Filter
es: Filtros

# searchHomeByTopic
source: Search by topic
de: Suche nach Thema
es: Buscar por tema

# topics
source: animals:architecture-interior:history:business-work:current-events:experimental:fashion-beauty:film:food-drink:health:nature:people:spirituality:sports:street:technology:textures-patterns:travel:wallpapers:3d-renders
de: tiere:architektur-design:geschichte:arbeit-geschaeft:aktuelles:mode:kunst:essen-trinken:gesundheit:natur:menschen:sport:strasse:technologie:texturen-muster:reisen:hintergrundbilder:wissenschaft
es: animales:arquitectura-diseño:historia:trabajo-negocios:actualidad:experimental:moda:cine:comida-bebida:salud:naturaleza:gente:espiritualidad:deportes:calle:tecnología:texturas-patrones:viajes:fondos de pantalla:3d-renders

# bottomSheetFilterByOrientation
source: Filter by Orientation
de: Filter durch Orientierung
es: Filtrar por Orientación

# bottomSheetFilterByColor
source: Filter by Color
de: Filter durch Farbe
es: Filtrar por Color

# bottomSheetFilterClean
source: Clean
de: Sauber
es: Limpiar

# bottomSheetFilterOrientation
source: {OrientationFilter, select, landscape{landscape} portrait{portrait} squarish{squarish} other{unknown}}
de: {OrientationFilter, select, landscape{Landschaft} portrait{Porträt} squarish{quadratisch} other{unbekannt}}
es: {OrientationFilter, select, landscape{paisaje} portrait{retrato} squarish{cuadrado} other{unknown}}

# albumNoImages
source: No image found
de: Kein Bild gefunden
es: Ninguna imagen encontrada

# favoritesAppBar
source: Favorites
de: Favoritinnen
es: Favoritos

# favoritesConfirmDelete
source: Confirm delete
de: Löschen bestätigen
es: Confirmar borrado

# favoritesRemoveAll
source: This will remove all favorites
de: Dies wird alle Favoriten entfernen
es: Esto eliminará todos los favoritos

# favoritesCancel
source: Cancel
de: Stornieren
es: Cancelar

# favoritesNoImages
source: There are no favorites
de: Es gibt keine Favoriten
es: No hay favoritos

# settingsAppBar
source: Settings
de: Einstellungen
es: Ajustes

# settingsLanguage
source: Language
de: Sprache
es: Idioma

# settingsThemeLight
source: Theme light
de: Themenlicht
es: Luz del tema

# settingsNumberColumns
source: Number of columns on the results page
de: Anzahl der Spalten auf der Ergebnisseite
es: Número de columnas en la página de resultados

# settingsRemoveCache
source: Remove cache from images
de: Entfernen Sie den Cache aus den Bildern
es: Eliminar memoria caché de las imágenes

# settingsCacheRemoved
source: Cache memory removed
de: Cache -Speicher entfernt
es: Memoria caché eliminada

# settingsSize
source: Size
de: Größe
es: Tamaño

# settingsSavedSettings
source: Saved settings
de: Gespeicherte Einstellungen
es: Ajustes guardados

# settingsSave
source: Save settings
de: Einstellungen speichern
es: Guardar ajustes

# singleFavoriteAdd
source: Added favorite
de: Favoriten hinzugefügt
es: Favorito añadido

# singleFavoriteDeleted
source: Deleted favorite
de: Gelöschter Favorit
es: Favorito eliminado

# singleDownloadLinkNotFound
source: Download link not found
de: Download -Link nicht gefunden
es: Enlace de descarga no encontrado

# singleAuthorizationFailed
source: Authorization failed
de: Autorisation fehlgeschlagen
es: Error de autorización

# singleServerFailed
source: Server response failed
de: Die Serverantwort fehlgeschlagen
es: Error en la respuesta del servidor

# singleErrorDownloading
source: Error downloading image: {message}
de: Fehler beim Herunterladen von Bild: {message}
es: Error descargando la imagen {message}

# singleDownloadedAt
source: Image downloaded at {message}
de: Bild heruntergeladen bei {message}
es: Imagen descargada en {message}

# singleDownloadAborted
source: Download process aborted. The license may not support direct download
de: Download -Prozess abgebrochen.Die Lizenz unterstützt möglicherweise keinen direkten Download
es: Proceso de descarga abortado. Puede que la licencia no admita la descarga directa

# singleGreatPicture
source: Great picture from {appName}
de: Tolles Bild von {appName}
es: Gran foto desde {appName}

# singleGetError
source: There was an error getting the photos
de: Es gab einen Fehler, den die Fotos zu erhalten
es: Ha ocurrido un error obteniendo las fotos

# singleNoTitle
source: No title
de: Kein Titel
es: Sin título

# cardViewError
source: There was an error getting the photos
de: Es gab einen Fehler, den die Fotos zu erhalten
es: Se ha producido un error obteniendo las fotos

# popMenuOptionScreen
source: {OptionScreen, select, favorites{Favorites} settings{Settings} about{About} other{other}}
de: {OptionScreen, select, favorites{Favoritinnen} settings{Einstellungen} about{About} other{unbekannt}}
es: {OptionScreen, select, favorites{Favoritos} settings{Ajustes} about{About} other{other}}

# aboutSubtitle
source: #### META SEARCH ENGINE FOR PHOTOS ON THE BEST IMAGES PLATFORMS
de: #### FOTO-METASUCHMASCHINE: SUCHE IN DEN BESTEN BILDDATENBANKEN, FINDEN IN PHOTOTOOK
es: #### METABUSCADOR DE FOTOS EN LAS MEJORES PLATAFORMAS DE IMÁGENES

# aboutIntro1
source: **PhotoTook** searches for photos on top image platforms, including Unsplash, Pexels, Flickr, Pixabay and Openverse. In future revisions, these sources may be modified or expanded.
de: **PhotoTook** Sucht nach Fotos auf Top -Image -Plattformen, einschließlich Unplash, Pexels, Flickr, Pixabay und OpenSverse.In zukünftigen Überarbeitungen können diese Quellen geändert oder erweitert werden.
es: **PhotoTook** busca fotos en las mejores plataformas de imágenes, como Unsplash, Pexels, Flickr, Pixabay y Openverse. En futuras revisiones, es posible que estas fuentes se modifiquen o amplíen.

# aboutIntro2
source: The app accesses photos from the platforms through their API and has no official relationship with any of them. Each platform owns its registered trademark and logo and this application is not sponsored or supported by any.
de: Die App greift über ihre API von den Plattformen auf Fotos zu und hat keine offizielle Beziehung zu ihnen.Jede Plattform besitzt ihre eingetragene Marken- und Logo, und diese Anwendung wird von keinem von einer gesponsert oder unterstützt.
es: La aplicación accede a las fotos de las plataformas a través de su API y no tiene relación oficial con ninguna de ellas. Cada plataforma es propietaria de su marca registrada y logotipo y esta aplicación no está patrocinada ni respaldada por ninguna.

# aboutIntro3
source: The app allows you to use some filters to search for photos, such as predominant color and orientation, although not all platforms support these filters.
de: Die App ermöglicht es Ihnen, einige Filter für die Suche nach Fotos zu verwenden, z. B. die vorherrschende Farbe und die Ausrichtung, obwohl nicht alle Plattformen diese Filter unterstützen.
es: La app permite utilizar algunos filtros para buscar fotos, como el color predominante y la orientación, aunque no todas las plataformas soportan estos filtros.

# aboutIntro4
source: The application presents the images and associated information in different layouts, and allows you to perform some actions on the images: bookmark, zoom, share and download to your device.
de: Die Anwendung stellt die Bilder und die zugehörigen Informationen in verschiedenen Layouts dar und ermöglicht es Ihnen, einige Aktionen mit den Bildern durchzuführen: Lesezeichen setzen, zoomen, teilen und auf Ihr Gerät herunterladen.
es: La aplicación presenta las imágenes y la información asociada en diferentes diseños, y permite realizar algunas acciones sobre las imágenes: marcar, hacer zoom, compartir y descargar en tu dispositivo.

# aboutIntro5
source: From the download action, the application tries to get the original image, but when that option is not available (due to server limitation or any other reason) then it tries to download the image with the largest possible size
de: Bei der Download-Aktion versucht die Anwendung, das Originalbild zu erhalten, aber wenn diese Option nicht verfügbar ist (aufgrund von Serverbeschränkungen oder aus anderen Gründen), versucht sie, das Bild mit der größtmöglichen Größe herunterzuladen.

# aboutIntro6
source: Use the favorites section as a temporary storage that takes up almost no memory. Note that no images are saved, only the links and data of that image, and some platforms generate dynamic links that update from time to time, so it is possible that some functions (such as downloading or zooming) may stop working on some saved favorites (only applicable to some platforms). It is also possible that an image saved in favorites may no longer be available on the platform. If you intend to use the images in the future, it is best to download them to your device.
de: Verwenden Sie den Favoritenbereich als temporären Speicher, der fast keinen Speicherplatz benötigt. Beachten Sie, dass keine Bilder gespeichert werden, sondern nur die Links und Daten für dieses Bild, und dass einige Plattformen dynamische Links generieren, die von Zeit zu Zeit aktualisiert werden, so dass es möglich ist, dass einige Funktionen (wie das Herunterladen oder Zoomen) bei einigen gespeicherten Lesezeichen nicht mehr funktionieren (gilt nur für einige Plattformen). Es ist auch möglich, dass ein in den Favoriten gespeichertes Bild nicht mehr auf der Plattform verfügbar ist. Wenn Sie die Bilder in Zukunft verwenden möchten, laden Sie sie am besten auf Ihr Gerät herunter.

# aboutAuthor
source: ## Author and License
de: ## Autor und Lizenz
es: ## Autor y Licencia

# aboutLicense
source: This app is freely shared under the terms of the *GNU General Public License v.3* in the hope that it will be useful, but WITHOUT ANY WARRANTY. This program is **free software**: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, version 3 (GPLv3). The GNU General Public License does not permit incorporating this program into proprietary programs.
de: Diese App wird unter den Bedingungen der allgemeinen öffentlichen Lizenz von * gnu frei geteilt.Dieses Programm ist ** Free Software **: Sie können es neu verteilen und/oder unter den Bedingungen der GNU General Public Lizenz wie von der Free Software Foundation, Version 3 (GPLV3) veröffentlicht.Die GNU General Public Lizenz erlaubt es nicht, dieses Programm in proprietäre Programme einzubeziehen.
es: Esta aplicación se comparte libremente bajo los términos de la *GNU General Public License v.3* con la esperanza de que sea útil, pero SIN NINGUNA GARANTÍA. Este programa es **software libre**: puede redistribuirlo y/o modificarlo bajo los términos de la Licencia Pública General GNU publicada por la Free Software Foundation, versión 3 (GPLv3). La Licencia Pública General GNU no permite incorporar este programa a programas propietarios.

# aboutSupport
source: ## Support
de: ## Unterstützung
es: ## Apoyo

# aboutSupport1
source: **PhotoTook** is *free and open source software*. Please consider contributing to keep the development of this App active. Thank you.
de: **Phototook** ist *kostenlose und Open -Source -Software*.Bitte überlegen Sie, ob die Entwicklung dieser App aktiv bleibt.Danke schön.
es: **PhotoTook** es *software libre y de código abierto*. Por favor, considera contribuir para mantener activo el desarrollo de esta App. Muchas gracias.

# aboutSupport2
source: Any suggestions, criticism, comments or bug reports are appreciated. Do you think you've found a problem? Identifying and fixing bugs makes this app better for everyone. Report a bug at [GitHub issues]({urlGitHubIssues}).
de: Alle Vorschläge, Kritik, Kommentare oder Fehlerberichte werden geschätzt.Glaubst du, du hast ein Problem gefunden?Wenn Sie Fehler identifizieren und beheben, wird diese App für alle besser.Einen Fehler melden [GitHub issues]({urlGitHubIssues}).
es: Agradecemos cualquier sugerencia, crítica, comentario o informe de errores. ¿Crees que has encontrado un problema? Identificar y corregir errores hace que esta aplicación sea mejor para todos. Informa de un error en [GitHub issues]({urlGitHubIssues}).

# aboutSupport3
source: You can help the development of this and other apps with a small contribution via PayPal or Bitcoins. Thank you!
de: Sie können die Entwicklung dieser und anderer Apps mit einem kleinen Beitrag über PayPal oder Bitcoins helfen.Danke schön!
es: Puedes ayudar al desarrollo de esta y otras aplicaciones con una pequeña contribución a través de PayPal o Bitcoins. Muchas gracias.

# aboutPaypal
source: Donate via Paypal (opens PayPal payment page):
de: Spenden Sie über PayPal (öffnet PayPal -Zahlungsseite):
es: Dona a través de Paypal (abre la página de pago de PayPal):

# aboutBTC1
source: To make a donation in Bitcoins, scan this QR code with your wallet app:
de: Um eine Spende in Bitcoins zu leisten, scannen Sie diesen QR -Code mit Ihrer Brieftaschen -App:
es: Para hacer una donación en Bitcoins, escanea este código QR con tu aplicación monedero:

# aboutBTC2
source: or copy my BTC wallet address:
de: Oder kopieren Sie meine BTC -Brieftaschenadresse:
es: o copia la dirección de mi monedero BTC:

# aboutWarranty
source: ## Warranty, Security and Privacy
de: ## Garantie, Sicherheit und Privatsphäre
es: ## Garantía, Seguridad y Privacidad

# aboutWarranty1
source: **Free and ad-free application**. No user data is used. **Open source software** (source code on Github), free of spyware, malware, viruses or any process that threatens your device or violates your privacy. This application does not extract or store any information or require any external permission, and renounces advertising and any tracking mechanism.
de: **Kostenlose und werbefreie Anwendung**. Es werden keine Benutzerdaten verwendet. **Open Source -Software** (Quellcode auf GitHub), frei von Spyware, Malware, Viren oder einem Prozess, der Ihr Gerät bedroht oder gegen Ihre Privatsphäre verstößt.Diese Anwendung extrahiert oder speichert keine Informationen oder erfordert eine externe Berechtigung und verzichtet auf Werbung und Verfolgungsmechanismus.
es: **Aplicación gratuita y sin publicidad**. No se recaban ni utilizan datos del usuario. **Software de código abierto** (código fuente en Github), libre de spyware, malware, virus o cualquier proceso que amenace tu dispositivo o viole tu privacidad. Esta aplicación no extrae ni almacena ninguna información ni requiere ningún permiso externo, y renuncia a la publicidad y a cualquier mecanismo de rastreo.

# aboutWarranty2
source: Each platform has its own terms and conditions and its own privacy and cookie policy, and images have different types of license and property rights for their use.
de: Jede Plattform hat ihre eigenen Allgemeinen Geschäftsbedingungen und ihre eigene Privatsphäre und Cookie -Richtlinien, und Bilder haben unterschiedliche Arten von Lizenz- und Eigentumsrechten für ihre Verwendung.
es: Cada plataforma tiene sus propios términos y condiciones y su propia política de privacidad y cookies, y las imágenes tienen diferentes tipos de licencia y derechos de propiedad para su uso.

# aboutWarranty3
source: It cannot be guaranteed that the content offered is free of errors, whether errors in the server from which the data originates, in the process of accessing the data or in its processing, so the information presented does not have any guarantee, either explicit or implicit. The user expressly agrees to be aware of this circumstance. The use of the information obtained by this App is carried out by the user at his own risk and expense, and he is solely responsible to third parties for any damages that may arise from it.
de: Es kann nicht garantiert werden, dass der angebotene Inhalt fehlerfrei ist, unabhängig davon.Der Benutzer stimmt ausdrücklich zu, sich dieser Umstände bewusst zu sein.Die Verwendung der von dieser App erhaltenen Informationen wird vom Benutzer auf eigene Risiko und Kosten durchgeführt, und er ist ausschließlich gegenüber Dritten verantwortlich für Schäden, die sich daraus ergeben können.
es: No se puede garantizar que el contenido ofrecido esté libre de errores, ya sean errores en el servidor del que proceden los datos, en el proceso de acceso a los datos o en su tratamiento, por lo que la información presentada no tiene ninguna garantía, ni explícita ni implícita. El usuario acepta expresamente ser consciente de esta circunstancia. La utilización de la información obtenida por esta App se realiza por el usuario por su propia cuenta y riesgo, siendo el único responsable frente a terceros de cualquier daño o perjuicio que pudieran derivarse de la misma.
